Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxEdsadc_bf.h
/** \brief Offset for Ifx_EDSADC_CH_TSTMP_Bits.TIMESTAMP */
#define IFX_EDSADC_CH_TSTMP_TIMESTAMP_OFF (0u)

/** \brief Length for Ifx_EDSADC_CH_TSTMP_Bits.AMX */
#define IFX_EDSADC_CH_TSTMP_AMX_LEN (2u)

/** \brief Mask for Ifx_EDSADC_CH_TSTMP_Bits.AMX */
#define IFX_EDSADC_CH_TSTMP_AMX_MSK (0x3u)

/** \brief Offset for Ifx_EDSADC_CH_TSTMP_Bits.AMX */
#define IFX_EDSADC_CH_TSTMP_AMX_OFF (16u)

/** \brief Length for Ifx_EDSADC_CH_TSTMP_Bits.TSVAL */
#define IFX_EDSADC_CH_TSTMP_TSVAL_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_TSTMP_Bits.TSVAL */
#define IFX_EDSADC_CH_TSTMP_TSVAL_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_TSTMP_Bits.TSVAL */
#define IFX_EDSADC_CH_TSTMP_TSVAL_OFF (31u)

/** \brief Length for Ifx_EDSADC_CH_TSCNT_Bits.TSCOUNT */
#define IFX_EDSADC_CH_TSCNT_TSCOUNT_LEN (16u)

/** \brief Mask for Ifx_EDSADC_CH_TSCNT_Bits.TSCOUNT */
#define IFX_EDSADC_CH_TSCNT_TSCOUNT_MSK (0xffffu)

/** \brief Offset for Ifx_EDSADC_CH_TSCNT_Bits.TSCOUNT */
#define IFX_EDSADC_CH_TSCNT_TSCOUNT_OFF (0u)

/** \brief Length for Ifx_EDSADC_CH_TSCNT_Bits.TSCLK */
#define IFX_EDSADC_CH_TSCNT_TSCLK_LEN (2u)

/** \brief Mask for Ifx_EDSADC_CH_TSCNT_Bits.TSCLK */
#define IFX_EDSADC_CH_TSCNT_TSCLK_MSK (0x3u)

/** \brief Offset for Ifx_EDSADC_CH_TSCNT_Bits.TSCLK */
#define IFX_EDSADC_CH_TSCNT_TSCLK_OFF (16u)

/** \brief Length for Ifx_EDSADC_CH_TSCNT_Bits.TSCRUN */
#define IFX_EDSADC_CH_TSCNT_TSCRUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_TSCNT_Bits.TSCRUN */
#define IFX_EDSADC_CH_TSCNT_TSCRUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_TSCNT_Bits.TSCRUN */
#define IFX_EDSADC_CH_TSCNT_TSCRUN_OFF (19u)

/** \brief Length for Ifx_EDSADC_CH_TSCNT_Bits.AMXCOPY */
#define IFX_EDSADC_CH_TSCNT_AMXCOPY_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_TSCNT_Bits.AMXCOPY */
#define IFX_EDSADC_CH_TSCNT_AMXCOPY_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_TSCNT_Bits.AMXCOPY */
#define IFX_EDSADC_CH_TSCNT_AMXCOPY_OFF (20u)

/** \brief Length for Ifx_EDSADC_CH_FCFGA_Bits.CFAEN */
#define IFX_EDSADC_CH_FCFGA_CFAEN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_FCFGA_Bits.CFAEN */
#define IFX_EDSADC_CH_FCFGA_CFAEN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_FCFGA_Bits.CFAEN */
#define IFX_EDSADC_CH_FCFGA_CFAEN_OFF (0u)

/** \brief Length for Ifx_EDSADC_CH_FCFGA_Bits.CFADF */
#define IFX_EDSADC_CH_FCFGA_CFADF_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_FCFGA_Bits.CFADF */
#define IFX_EDSADC_CH_FCFGA_CFADF_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_FCFGA_Bits.CFADF */
#define IFX_EDSADC_CH_FCFGA_CFADF_OFF (1u)

/** \brief Length for Ifx_EDSADC_CH_FCFGA_Bits.CFACNT */
#define IFX_EDSADC_CH_FCFGA_CFACNT_LEN (5u)

/** \brief Mask for Ifx_EDSADC_CH_FCFGA_Bits.CFACNT */
#define IFX_EDSADC_CH_FCFGA_CFACNT_MSK (0x1fu)

/** \brief Offset for Ifx_EDSADC_CH_FCFGA_Bits.CFACNT */
#define IFX_EDSADC_CH_FCFGA_CFACNT_OFF (16u)

/** \brief Length for Ifx_EDSADC_CH_BOUNDSEL_Bits.BOUNDARYL */
#define IFX_EDSADC_CH_BOUNDSEL_BOUNDARYL_LEN (16u)

/** \brief Mask for Ifx_EDSADC_CH_BOUNDSEL_Bits.BOUNDARYL */
#define IFX_EDSADC_CH_BOUNDSEL_BOUNDARYL_MSK (0xffffu)

/** \brief Offset for Ifx_EDSADC_CH_BOUNDSEL_Bits.BOUNDARYL */
#define IFX_EDSADC_CH_BOUNDSEL_BOUNDARYL_OFF (0u)

/** \brief Length for Ifx_EDSADC_CH_BOUNDSEL_Bits.BOUNDARYU */
#define IFX_EDSADC_CH_BOUNDSEL_BOUNDARYU_LEN (16u)

/** \brief Mask for Ifx_EDSADC_CH_BOUNDSEL_Bits.BOUNDARYU */
#define IFX_EDSADC_CH_BOUNDSEL_BOUNDARYU_MSK (0xffffu)

/** \brief Offset for Ifx_EDSADC_CH_BOUNDSEL_Bits.BOUNDARYU */
#define IFX_EDSADC_CH_BOUNDSEL_BOUNDARYU_OFF (16u)

/** \brief Length for Ifx_EDSADC_CH_RESA_Bits.RESULT */
#define IFX_EDSADC_CH_RESA_RESULT_LEN (16u)

/** \brief Mask for Ifx_EDSADC_CH_RESA_Bits.RESULT */
#define IFX_EDSADC_CH_RESA_RESULT_MSK (0xffffu)

/** \brief Offset for Ifx_EDSADC_CH_RESA_Bits.RESULT */
#define IFX_EDSADC_CH_RESA_RESULT_OFF (0u)

/** \brief Length for Ifx_EDSADC_CH_CGSYNC_Bits.SDCOUNT */
#define IFX_EDSADC_CH_CGSYNC_SDCOUNT_LEN (8u)

/** \brief Mask for Ifx_EDSADC_CH_CGSYNC_Bits.SDCOUNT */
#define IFX_EDSADC_CH_CGSYNC_SDCOUNT_MSK (0xffu)

/** \brief Offset for Ifx_EDSADC_CH_CGSYNC_Bits.SDCOUNT */
#define IFX_EDSADC_CH_CGSYNC_SDCOUNT_OFF (0u)

/** \brief Length for Ifx_EDSADC_CH_CGSYNC_Bits.SDCAP */
#define IFX_EDSADC_CH_CGSYNC_SDCAP_LEN (8u)

/** \brief Mask for Ifx_EDSADC_CH_CGSYNC_Bits.SDCAP */
#define IFX_EDSADC_CH_CGSYNC_SDCAP_MSK (0xffu)

/** \brief Offset for Ifx_EDSADC_CH_CGSYNC_Bits.SDCAP */
#define IFX_EDSADC_CH_CGSYNC_SDCAP_OFF (8u)

/** \brief Length for Ifx_EDSADC_CH_CGSYNC_Bits.SDPOS */
#define IFX_EDSADC_CH_CGSYNC_SDPOS_LEN (8u)

/** \brief Mask for Ifx_EDSADC_CH_CGSYNC_Bits.SDPOS */
#define IFX_EDSADC_CH_CGSYNC_SDPOS_MSK (0xffu)

/** \brief Offset for Ifx_EDSADC_CH_CGSYNC_Bits.SDPOS */
#define IFX_EDSADC_CH_CGSYNC_SDPOS_OFF (16u)

/** \brief Length for Ifx_EDSADC_CH_CGSYNC_Bits.SDNEG */
#define IFX_EDSADC_CH_CGSYNC_SDNEG_LEN (8u)

/** \brief Mask for Ifx_EDSADC_CH_CGSYNC_Bits.SDNEG */
#define IFX_EDSADC_CH_CGSYNC_SDNEG_MSK (0xffu)

/** \brief Offset for Ifx_EDSADC_CH_CGSYNC_Bits.SDNEG */
#define IFX_EDSADC_CH_CGSYNC_SDNEG_OFF (24u)

/** \brief Length for Ifx_EDSADC_CH_RECTCFG_Bits.RFEN */
#define IFX_EDSADC_CH_RECTCFG_RFEN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_RECTCFG_Bits.RFEN */
#define IFX_EDSADC_CH_RECTCFG_RFEN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_RECTCFG_Bits.RFEN */
#define IFX_EDSADC_CH_RECTCFG_RFEN_OFF (0u)

/** \brief Length for Ifx_EDSADC_CH_RECTCFG_Bits.SSRC */
#define IFX_EDSADC_CH_RECTCFG_SSRC_LEN (2u)

/** \brief Mask for Ifx_EDSADC_CH_RECTCFG_Bits.SSRC */
#define IFX_EDSADC_CH_RECTCFG_SSRC_MSK (0x3u)

/** \brief Offset for Ifx_EDSADC_CH_RECTCFG_Bits.SSRC */
#define IFX_EDSADC_CH_RECTCFG_SSRC_OFF (4u)

/** \brief Length for Ifx_EDSADC_CH_RECTCFG_Bits.SSCH */
#define IFX_EDSADC_CH_RECTCFG_SSCH_LEN (4u)

/** \brief Mask for Ifx_EDSADC_CH_RECTCFG_Bits.SSCH */
#define IFX_EDSADC_CH_RECTCFG_SSCH_MSK (0xfu)

/** \brief Offset for Ifx_EDSADC_CH_RECTCFG_Bits.SSCH */
#define IFX_EDSADC_CH_RECTCFG_SSCH_OFF (8u)

/** \brief Length for Ifx_EDSADC_CH_RECTCFG_Bits.SDCVAL */
#define IFX_EDSADC_CH_RECTCFG_SDCVAL_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_RECTCFG_Bits.SDCVAL */
#define IFX_EDSADC_CH_RECTCFG_SDCVAL_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_RECTCFG_Bits.SDCVAL */
#define IFX_EDSADC_CH_RECTCFG_SDCVAL_OFF (15u)

/** \brief Length for Ifx_EDSADC_CH_RECTCFG_Bits.SGNCS */
#define IFX_EDSADC_CH_RECTCFG_SGNCS_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_RECTCFG_Bits.SGNCS */
#define IFX_EDSADC_CH_RECTCFG_SGNCS_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_RECTCFG_Bits.SGNCS */
#define IFX_EDSADC_CH_RECTCFG_SGNCS_OFF (30u)

/** \brief Length for Ifx_EDSADC_CH_RECTCFG_Bits.SGND */
#define IFX_EDSADC_CH_RECTCFG_SGND_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_RECTCFG_Bits.SGND */
#define IFX_EDSADC_CH_RECTCFG_SGND_MSK (0x1u)

